**Exercise: Build decision tree model to predict survival based on certain parameters**

CSV file is available to download at https://github.com/codebasics/py/blob/master/ML/9_decision_tree/Exercise/titanic.csv

In this file using following columns build a model to predict if person would survive or not
   
    1. Pclass
    2. Sex
    3. Age
    4. Fare

Calculate score of your model

In [1]:
import os
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [2]:
path=os.getcwd()

In [3]:
data=pd.read_csv(path+'\\titanic.csv')

In [4]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
X=data[['Pclass','Sex','Age','Fare']]

In [7]:
y=data.Survived

In [8]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [9]:
X.isnull().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [10]:
X=X.fillna(value={'Age':X.Age.mean()})

In [11]:
X.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [12]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [13]:
le=LabelEncoder()

In [14]:
X['Sex_encoder']=le.fit_transform(X.Sex)

In [15]:
X.head()

   Pclass     Sex   Age     Fare  Sex_encoder
0       3    male  22.0   7.2500            1
1       1  female  38.0  71.2833            0
2       3  female  26.0   7.9250            0
3       1  female  35.0  53.1000            0
4       3    male  35.0   8.0500            1

In [16]:
X.drop('Sex',axis='columns',inplace=True)

In [17]:
X.head()

   Pclass   Age     Fare  Sex_encoder
0       3  22.0   7.2500            1
1       1  38.0  71.2833            0
2       3  26.0   7.9250            0
3       1  35.0  53.1000            0
4       3  35.0   8.0500            1

In [18]:
model_tree=tree.DecisionTreeClassifier()

In [19]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [20]:
model_tree.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [21]:
model_tree.score(X_test,y_test)

0.7988826815642458